# Parameter Type Id Rebar Shape Crank End Offset Property

Source: https://www.revitapidocs.com/2026/bda370c1-0692-b9e3-7af6-8ae7f0e50d6d.htm

---

| Parameter Type Id Rebar Shape Crank End Offset Property |
| --- |

"End Crank Offset"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankEndOffset { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankEndOffset As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankEndOffset {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankEndOffset : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace